#simple input:
'''
182 243
'''
'''
123 321
'''
# simple output:
'''
Yes
'''
'''
No
'''
# First System:
# Accepted:

'''
A, B = input().split()
a = list(A)
b = list(B)
r_1 = a[::-1]
r_2 = b[::-1]
count = 0
if len(r_1) >= len(r_2):
    len = len(r_2)
else:
    len = len(r_1)
for i in range(0,len):
    sum = int(r_1[i]) + int(r_2[i])
    if sum > 9:
        count += 1
if count != 0:
    print("Yes")
else:
    print("No")
  '''
# Second System:
# Accepted:

a,b= map(int,input().split())
li = []
for i in str(a):
    a = int(i)
    if a < 5:
        li.append(a)
li_2 = []
for j in str(b):
    b = int(j)
    if b<=5:
        li_2.append(b)
if len(li) == len(str(a)) and len(li_2) == len(str(b)):
    print("No")
else:
    print("Yes")


# Problem Details:
'''
ব্যাঙের যোগ:
ব্যাঙ কিভাবে সংখ্যাগুলো যোগ করতে হয় তা শিখতেছে। যাইহোক, যখন ক্যারি থাকে তখন সে বিভ্রান্ত হয়ে যায়।
ব্যাঙকে সাহায্য করতে তোমাকে একটা প্রোগ্রাম লিখতে হবে যা দুইটি পূর্ণসংখ্যা ইনপুট নিবে এবং এগুলো যোগ করার সময় ব্যাঙ কোনো ক্যারি পাবে কী না তা বের করবে।

উদাহরণস্বরুপ, ১৮২ এবং ২৪২ যোগ করার সময় ব্যাঙ ক্যারি পাবেঃ

  ১৮২
+ ২৪৩
-----
    ৫ (ক্যারি ০)
  ---
   ২৫ (ক্যারি ১; এটি ব্যাঙকে বিভ্রান্ত করবে)
  ---
  ৪২৫ (ক্যারি ০)
অন্যদিকে, ১২৩ এবং ৩২১ যোগ করার সময় ব্যাঙ কোনো ক্যারি পাবে না, এবং এটি ব্যাঙকে বিভ্রান্ত করবে না।
 ১২৩
+ ৩২১
-----
    ৪ (ক্যারি ০)
  ---
   ৪৪ (ক্যারি ০)
  ---
  ৪৪৪ (ক্যারি ০)
Input:
ইনপুটে স্পেস দিয়ে আলাদা করা দুইটি পূর্ণসংখ্যা A এবং B (0 ≤ A, B < 1000000) দেয়া থাকবে।

Output:
যদি A এবং B ব্যাঙকে বিভ্রান্ত করে তবে "Yes" প্রিন্ট করো অন্যথায় "No" প্রিন্ট করো।
'''
  
